[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.jsx:121:37
               id="email"
               type="text"
               isInvalid={Boolean(errors.email)}
-              {...register("email", {
-                required: "Email is required.",
-                pattern: {
-                  value: email_regex,
-                  message: "Email must be a valid email address.",
-                },
-              })}
+              {...register("email", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
