[Killed] ArrowFunction
main/pages/MenuItem/MenuItemEditPage.jsx:28:34
     },
   );
 
-  const objectToAxiosPutParams = (MenuItem) => ({
-    url: "/api/ucsbdiningcommonsmenuitem",
-    method: "PUT",
-    params: {
-      id: MenuItem.id,
-    },
-    data: {
-      diningCommonsCode: MenuItem.diningCommonsCode,
-      name: MenuItem.name,
-      station: MenuItem.station,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (MenuItem) => {
killedBy: MenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Menu Item Updated - id: 17 name: keer",

[Killed] ObjectLiteral
main/pages/MenuItem/MenuItemEditPage.jsx:28:49
     },
   );
 
-  const objectToAxiosPutParams = (MenuItem) => ({
-    url: "/api/ucsbdiningcommonsmenuitem",
-    method: "PUT",
-    params: {
-      id: MenuItem.id,
-    },
-    data: {
-      diningCommonsCode: MenuItem.diningCommonsCode,
-      name: MenuItem.name,
-      station: MenuItem.station,
-    },
-  });
+  const objectToAxiosPutParams = (MenuItem) => ({});
 
   const onSuccess = (MenuItem) => {
killedBy: MenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Menu Item Updated - id: 17 name: keer",

[Killed] StringLiteral
main/pages/MenuItem/MenuItemEditPage.jsx:29:10
   );
 
   const objectToAxiosPutParams = (MenuItem) => ({
-    url: "/api/ucsbdiningcommonsmenuitem",
+    url: "",
     method: "PUT",
     params: {
killedBy: MenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Menu Item Updated - id: 17 name: keer",

[Killed] ObjectLiteral
main/pages/MenuItem/MenuItemEditPage.jsx:31:13
   const objectToAxiosPutParams = (MenuItem) => ({
     url: "/api/ucsbdiningcommonsmenuitem",
     method: "PUT",
-    params: {
-      id: MenuItem.id,
-    },
+    params: {},
     data: {
       diningCommonsCode: MenuItem.diningCommonsCode,
killedBy: MenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected {} to deeply equal { id: 17 }

[Killed] ObjectLiteral
main/pages/MenuItem/MenuItemEditPage.jsx:34:11
     params: {
       id: MenuItem.id,
     },
-    data: {
-      diningCommonsCode: MenuItem.diningCommonsCode,
-      name: MenuItem.name,
-      station: MenuItem.station,
-    },
+    data: {},
   });
 
killedBy: MenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected '{}' to be '{"diningCommonsCode":"carillo","name"…' // Object.is equality

[Killed] BlockStatement
main/pages/MenuItem/MenuItemEditPage.jsx:41:35
     },
   });
 
-  const onSuccess = (MenuItem) => {
-    toast(`Menu Item Updated - id: ${MenuItem.id} name: ${MenuItem.name}`);
-  };
+  const onSuccess = (MenuItem) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
main/pages/MenuItem/MenuItemEditPage.jsx:66:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Menu Item</h1>
-        {MenuItem && (
-          <MenuItemForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={MenuItem}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: MenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="MenuItemForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/MenuItem/MenuItemEditPage.jsx:66:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Menu Item</h1>
-        {MenuItem && (
-          <MenuItemForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={MenuItem}
-          />
-        )}
+        {MenuItem || <MenuItemForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={MenuItem} />}
       </div>
     </BasicLayout>
killedBy: MenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="MenuItemForm-id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
