[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.jsx:66:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.requesterEmail?.message}
-              {errors.requesterEmail?.type === "pattern" &&
-                "Requester email must be a valid email address."}
+              {errors.requesterEmail?.type === "pattern" || "Requester email must be a valid email address."}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests Correct Error messages on bad input
statusReason: Unable to find an element with the text: /Requester email must be a valid email address./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] EqualityOperator
main/components/HelpRequest/HelpRequestForm.jsx:66:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.requesterEmail?.message}
-              {errors.requesterEmail?.type === "pattern" &&
+              {errors.requesterEmail?.type !== "pattern" &&
                 "Requester email must be a valid email address."}
             </Form.Control.Feedback>
killedBy: HelpRequestForm tests Correct Error messages on bad input
statusReason: Unable to find an element with the text: /Requester email must be a valid email address./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
