[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:42:5
       accessorKey: "id", // accessor is the "key" in the data
     },
 
-    {
-      header: "OrgCode",
-      accessorKey: "orgCode",
-    },
+    {},
     {
       header: "OrgTranslationShort",
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] BlockStatement
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:60:43
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "UCSBOrganizationTable"),
-    );
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "UCSBOrganizationTable"),
-    );
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
   return (
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:62:28
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "UCSBOrganizationTable"),
+      ButtonColumn("Edit", "", editCallback, "UCSBOrganizationTable"),
     );
     columns.push(
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn
