[Killed] ObjectLiteral
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:17:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/menuitemreview?id=${id}`],
-    {
-      // Stryker disable next-line all : GET is default
-      method: "GET",
-      url: "/api/menuitemreview",
-      params: { id },
-    },
+    {},
   );
 
killedBy: MenuItemReviewEditPage — kill survivors loads with correct GET params, submits PUT with params/body, shows exact toast, then navigates
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-itemId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:20:12
     {
       // Stryker disable next-line all : GET is default
       method: "GET",
-      url: "/api/menuitemreview",
+      url: "",
       params: { id },
     },
killedBy: MenuItemReviewEditPage — kill survivors loads with correct GET params, submits PUT with params/body, shows exact toast, then navigates
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-itemId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:25:34
     },
   );
 
-  const objectToAxiosPutParams = (mir) => ({
-    url: "/api/menuitemreview",
-    method: "PUT",
-    params: { id: mir.id },
-    data: {
-      itemId: mir.itemId,
-      reviewerEmail: mir.reviewerEmail,
-      stars: mir.stars,
-      dateReviewed: mir.dateReviewed,
-      comments: mir.comments,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (mir) => {
killedBy: MenuItemReviewEditPage — kill survivors loads with correct GET params, submits PUT with params/body, shows exact toast, then navigates
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:29:11
     url: "/api/menuitemreview",
     method: "PUT",
     params: { id: mir.id },
-    data: {
-      itemId: mir.itemId,
-      reviewerEmail: mir.reviewerEmail,
-      stars: mir.stars,
-      dateReviewed: mir.dateReviewed,
-      comments: mir.comments,
-    },
+    data: {},
   });
 
killedBy: MenuItemReviewEditPage — kill survivors loads with correct GET params, submits PUT with params/body, shows exact toast, then navigates
statusReason: expected {} to match object { itemId: 2, …(2) }

[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:38:30
     },
   });
 
-  const onSuccess = (mir) => {
-    toast(
-      `MenuItemReview Updated - id: ${mir.id} itemId: ${mir.itemId} stars: ${mir.stars}`,
-    );
-  };
+  const onSuccess = (mir) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemReviewEditPage — kill survivors loads with correct GET params, submits PUT with params/body, shows exact toast, then navigates
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:40:7
 
   const onSuccess = (mir) => {
     toast(
-      `MenuItemReview Updated - id: ${mir.id} itemId: ${mir.itemId} stars: ${mir.stars}`,
+      ``,
     );
   };
killedBy: MenuItemReviewEditPage — kill survivors loads with correct GET params, submits PUT with params/body, shows exact toast, then navigates
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "MenuItemReview Updated - id: 1 itemId: 2 stars: 4",
