[Killed] BlockStatement
main/components/HelpRequest/HelpRequestTable.jsx:17:42
     navigate(`/helprequest/edit/${cell.row.original.id}`);
   };
 
-  const deleteCallback = async (cell) => {
-    // Delete functionality will be implemented later
-    console.log("Delete callback for id: ", cell.row.original.id);
-  };
+  const deleteCallback = async (cell) => {};
 
   const columns = [
killedBy: HelpRequestTable tests Delete button calls delete callback
statusReason: expected "log" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Survived] StringLiteral
main/components/HelpRequest/HelpRequestTable.jsx:19:17
 
   const deleteCallback = async (cell) => {
     // Delete functionality will be implemented later
-    console.log("Delete callback for id: ", cell.row.original.id);
+    console.log("", cell.row.original.id);
   };
 

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.jsx:35:5
       header: "Team Id",
       accessorKey: "teamId",
     },
-    {
-      header: "Table/Breakout Room",
-      accessorKey: "tableOrBreakoutRoom",
-    },
+    {},
     {
       header: "Request Time",
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.jsx:40:15
       accessorKey: "tableOrBreakoutRoom",
     },
     {
-      header: "Request Time",
+      header: "",
       accessorKey: "requestTime",
     },
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Request Time. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestTable"
