[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:19:6
     _status,
   } = useBackend(
     // React Query key (must be unique per orgCode)
-    [`/api/UCSBOrganization?orgCode=${orgCode}`],
+    [``],
     //[`/api/UCSBOrganization`, { params: { orgCode } }],
     {
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally internal API calls calls useBackend and useBackendMutation with correct keys and methods
statusReason: expected "useBackend" to be called with arguments: [ …(2) ]

Received: 

  1st useBackend call:

@@ -1,10 +1,10 @@
  [

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:25:15
       method: "GET",
       url: "/api/UCSBOrganization",
       //params: { orgCode: orgCode }, // send as query parameter
-      params: { orgCode },
+      params: {},
     },
   );
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:30:34
   );
 
   // PUT request to update an organization
-  const objectToAxiosPutParams = (ucsborganization) => ({
-    url: "/api/UCSBOrganization",
-    method: "PUT",
-    params: { orgCode: ucsborganization.orgCode },
-    data: {
-      orgTranslationShort: ucsborganization.orgTranslationShort,
-      orgTranslation: ucsborganization.orgTranslation,
-      inactive: ucsborganization.inactive,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   // Toast after successful update
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "UCSBOrganization Updated - orgCode: UCSBBB",

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:31:10
 
   // PUT request to update an organization
   const objectToAxiosPutParams = (ucsborganization) => ({
-    url: "/api/UCSBOrganization",
+    url: "",
     method: "PUT",
     params: { orgCode: ucsborganization.orgCode },
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "UCSBOrganization Updated - orgCode: UCSBBB",

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:33:13
   const objectToAxiosPutParams = (ucsborganization) => ({
     url: "/api/UCSBOrganization",
     method: "PUT",
-    params: { orgCode: ucsborganization.orgCode },
+    params: {},
     data: {
       orgTranslationShort: ucsborganization.orgTranslationShort,
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected {} to deeply equal { orgCode: 'UCSBBBB' }

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:34:11
     url: "/api/UCSBOrganization",
     method: "PUT",
     params: { orgCode: ucsborganization.orgCode },
-    data: {
-      orgTranslationShort: ucsborganization.orgTranslationShort,
-      orgTranslation: ucsborganization.orgTranslation,
-      inactive: ucsborganization.inactive,
-    },
+    data: {},
   });
 
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected '{}' to be '{"orgTranslationShort":"UCSBBADMINTON…' // Object.is equality

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:42:43
   });
 
   // Toast after successful update
-  const onSuccess = (ucsborganization) => {
-    toast(`UCSBOrganization Updated - orgCode: ${ucsborganization.orgCode}`);
-  };
+  const onSuccess = (ucsborganization) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:49:6
   const mutation = useBackendMutation(
     objectToAxiosPutParams,
     { onSuccess },
-    [`/api/UCSBOrganization?orgCode=${orgCode}`],
+    [``],
     //[`/api/UCSBOrganization`, { params: { orgCode } }],
   );
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally internal API calls calls useBackend and useBackendMutation with correct keys and methods
statusReason: expected "useBackendMutation" to be called with arguments: [ Any<Function>, Any<Object>, …(1) ]

Received: 

  1st useBackendMutation call:

  [
-   Any<Function>,
