[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:3:57
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function RecommendationRequestEditPage() {
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Edit page for Recommendation Request (placeholder)</h1>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function RecommendationRequestEditPage() {}
 
killedBy: RecommendationRequestEditPage tests Renders expected content
statusReason: Unable to find an element with the text: Edit page for Recommendation Request (placeholder). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
