[Killed] ArrowFunction
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:9:31
 
 export default function RecommendationRequestCreatePage({ storybook = false }) {
 
-  const objectToAxiosParams = (req) => ({
-    url: "/api/recommendationrequests/post",
-    method: "POST",
-    params: {
-      requesterEmail: req.requesterEmail,
-      professorEmail: req.professorEmail,
-      explanation: req.explanation,
-      dateRequested: req.dateRequested, 
-      dateNeeded: req.dateNeeded,       
-      done: req.done,                  
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (created) => {
killedBy: RecommendationRequestCreatePage tests submits and calls POST /api/recommendationrequests/post with correct params
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:22:34
     },
   });
 
-  const onSuccess = (created) => {
-    toast(`New recommendation request created - id: ${created.id}`);
-  };
+  const onSuccess = (created) => {};
 
 
killedBy: RecommendationRequestCreatePage tests submits and calls POST /api/recommendationrequests/post with correct params
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0
