[Killed] BlockStatement
main/components/MenuItemReview/MenuItemReviewTable.jsx:10:44
 import { toast } from "react-toastify";
 
 
-export const buildDeleteParams = (cell) => {
-  const id = cell?.row?.values?.id ?? cell?.row?.original?.id;
-  return {
-    url: "/api/menuitemreview",
-    method: "DELETE",
-    params: { id },
-  };
-};
+export const buildDeleteParams = (cell) => {};
 
 export const onDeleteSuccess = (_message) => {
killedBy: MenuItemReviewIndexPage tests what happens when you click delete, admin
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] OptionalChaining
main/components/MenuItemReview/MenuItemReviewTable.jsx:11:14
 
 
 export const buildDeleteParams = (cell) => {
-  const id = cell?.row?.values?.id ?? cell?.row?.original?.id;
+  const id = cell?.row?.values.id ?? cell?.row?.original?.id;
   return {
     url: "/api/menuitemreview",
killedBy: MenuItemReviewIndexPage tests what happens when you click delete, admin
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewTable.jsx:11:14
 
 
 export const buildDeleteParams = (cell) => {
-  const id = cell?.row?.values?.id ?? cell?.row?.original?.id;
+  const id = cell?.row?.values?.id && cell?.row?.original?.id;
   return {
     url: "/api/menuitemreview",
killedBy: MenuItemReviewIndexPage tests what happens when you click delete, admin
statusReason: expected { id: undefined } to deeply equal { id: 1 }

[Killed] BlockStatement
main/components/MenuItemReview/MenuItemReviewTable.jsx:19:46
   };
 };
 
-export const onDeleteSuccess = (_message) => {
-  void _message;
-  toast.success("MenuItemReview deleted successfully");
-};
+export const onDeleteSuccess = (_message) => {};
 
 export default function MenuItemReviewTable({
killedBy: MenuItemReviewTable helpers onDeleteSuccess shows success toast
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.jsx:21:17
 
 export const onDeleteSuccess = (_message) => {
   void _message;
-  toast.success("MenuItemReview deleted successfully");
+  toast.success("");
 };
 
killedBy: MenuItemReviewTable helpers onDeleteSuccess shows success toast
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "MenuItemReview deleted successfully",

[Killed] BlockStatement
main/components/MenuItemReview/MenuItemReviewTable.jsx:43:42
   );
   // Stryker restore all
 
-  const deleteCallback = async (cell) => {
-    await deleteMutation.mutateAsync(cell);
-  };
+  const deleteCallback = async (cell) => {};
 
   const columns = [
killedBy: MenuItemReviewTable tests Delete button calls delete callback
statusReason: expected 0 to be greater than 0

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] ArrayDeclaration
main/components/MenuItemReview/MenuItemReviewTable.jsx:47:19
     await deleteMutation.mutateAsync(cell);
   };
 
-  const columns = [
-    { header: "id", accessorKey: "id" },
-    { header: "Item ID", accessorKey: "itemId" },
-    { header: "Reviewer Email", accessorKey: "reviewerEmail" },
-    { header: "Stars", accessorKey: "stars" },
-    { header: "Date Reviewed", accessorKey: "dateReviewed" },
-    { header: "Comments", accessorKey: "comments" },
-  ];
+  const columns = [];
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="MenuItemReviewTable"

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.jsx:48:34
   };
 
   const columns = [
-    { header: "id", accessorKey: "id" },
+    { header: "id", accessorKey: "" },
     { header: "Item ID", accessorKey: "itemId" },
     { header: "Reviewer Email", accessorKey: "reviewerEmail" },
killedBy: MenuItemReviewTable tests Has expected headers, content and buttons for admin user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewTable.jsx:50:5
   const columns = [
     { header: "id", accessorKey: "id" },
     { header: "Item ID", accessorKey: "itemId" },
-    { header: "Reviewer Email", accessorKey: "reviewerEmail" },
+    {},
     { header: "Stars", accessorKey: "stars" },
     { header: "Date Reviewed", accessorKey: "dateReviewed" },
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewTable.jsx:51:5
     { header: "id", accessorKey: "id" },
     { header: "Item ID", accessorKey: "itemId" },
     { header: "Reviewer Email", accessorKey: "reviewerEmail" },
-    { header: "Stars", accessorKey: "stars" },
+    {},
     { header: "Date Reviewed", accessorKey: "dateReviewed" },
     { header: "Comments", accessorKey: "comments" },
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewTable.jsx:52:5
     { header: "Item ID", accessorKey: "itemId" },
     { header: "Reviewer Email", accessorKey: "reviewerEmail" },
     { header: "Stars", accessorKey: "stars" },
-    { header: "Date Reviewed", accessorKey: "dateReviewed" },
+    {},
     { header: "Comments", accessorKey: "comments" },
   ];
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewTable.jsx:53:5
     { header: "Reviewer Email", accessorKey: "reviewerEmail" },
     { header: "Stars", accessorKey: "stars" },
     { header: "Date Reviewed", accessorKey: "dateReviewed" },
-    { header: "Comments", accessorKey: "comments" },
+    {},
   ];
 
killedBy: MenuItemReviewTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.jsx:53:40
     { header: "Reviewer Email", accessorKey: "reviewerEmail" },
     { header: "Stars", accessorKey: "stars" },
     { header: "Date Reviewed", accessorKey: "dateReviewed" },
-    { header: "Comments", accessorKey: "comments" },
+    { header: "Comments", accessorKey: "" },
   ];
 
killedBy: MenuItemReviewTable tests Has expected headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="MenuItemReviewTable-cell-row-0-col-comments"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="MenuItemReviewTable"
