[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewCreatePage.jsx:20:34
     },
   });
 
-  const onSuccess = (created) => {
-    toast(`New MenuItemReview Created - id: ${created.id}`);
-  };
+  const onSuccess = (created) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemReviewCreatePage tests MenuItemReviewCreatePage tests on submit, builds correct request and shows toast on success
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] StringLiteral
main/pages/MenuItemReview/MenuItemReviewCreatePage.jsx:21:11
   });
 
   const onSuccess = (created) => {
-    toast(`New MenuItemReview Created - id: ${created.id}`);
+    toast(``);
   };
 
killedBy: MenuItemReviewCreatePage tests MenuItemReviewCreatePage tests on submit, builds correct request and shows toast on success
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "New MenuItemReview Created - id: 42",

[Killed] StringLiteral
main/pages/MenuItemReview/MenuItemReviewCreatePage.jsx:28:6
     objectToAxiosParams,
     { onSuccess },
 
-    ["/api/menuitemreview/all"],
+    [""],
   );
 
killedBy: MenuItemReviewCreatePage stale key & navigation contract MenuItemReviewCreatePage stale key contract passes ['/api/menuitemreview/all'] to useBackendMutation
statusReason: expected [ '' ] to deeply equal [ '/api/menuitemreview/all' ]

[Killed] ArrayDeclaration
main/pages/MenuItemReview/MenuItemReviewCreatePage.jsx:28:5
     objectToAxiosParams,
     { onSuccess },
 
-    ["/api/menuitemreview/all"],
+    [],
   );
 
killedBy: MenuItemReviewCreatePage stale key & navigation contract MenuItemReviewCreatePage stale key contract passes ['/api/menuitemreview/all'] to useBackendMutation
statusReason: expected [] to deeply equal [ '/api/menuitemreview/all' ]
