[Killed] StringLiteral
main/components/MenuItem/MenuItemTable.jsx:15:18
 export default function MenuItemTable({
   menuItems,
   currentUser,
-  testIdPrefix = "MenuItemTable",
+  testIdPrefix = "",
 }) {
   const navigate = useNavigate();
killedBy: MenuItemTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="MenuItemTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid=""
