[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.jsx:30:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col sm={12} md={6}>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid={`${testIdPrefix}-id`}
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {true}
 
         <Col sm={12} md={6}>
killedBy: MenuItemReviewForm tests renders correctly with initialContents (shows read-only id)
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.jsx:30:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col sm={12} md={6}>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid={`${testIdPrefix}-id`}
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {initialContents || <Col sm={12} md={6}>
+            <Form.Group className="mb-3">
+              <Form.Label htmlFor="id">Id</Form.Label>
+              <Form.Control data-testid={`${testIdPrefix}-id`} id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+            </Form.Group>
+          </Col>}
 
         <Col sm={12} md={6}>
killedBy: MenuItemReviewForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BooleanLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:56:32
               isInvalid={Boolean(errors.itemId)}
               {...register("itemId", {
                 required: "itemId is required.",
-                valueAsNumber: true,
+                valueAsNumber: false,
                 min: { value: 1, message: "itemId must be ≥ 1." },
               })}
killedBy: MenuItemReviewForm tests submits numbers as numbers (itemId, stars)
statusReason: expected 'string' to be 'number' // Object.is equality

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:57:43
               {...register("itemId", {
                 required: "itemId is required.",
                 valueAsNumber: true,
-                min: { value: 1, message: "itemId must be ≥ 1." },
+                min: { value: 1, message: "" },
               })}
             />
killedBy: MenuItemReviewForm tests shows correct min error message for itemId < 1
statusReason: Unable to find an element with the text: itemId must be ≥ 1.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:72:28
           <Form.Group className="mb-3">
             <Form.Label htmlFor="reviewerEmail">reviewerEmail</Form.Label>
             <Form.Control
-              data-testid={`${testIdPrefix}-reviewerEmail`}
+              data-testid={``}
               id="reviewerEmail"
               type="text"
killedBy: MenuItemReviewForm tests renders correctly with no initialContents
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-reviewerEmail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:99:37
               id="stars"
               type="number"
               isInvalid={Boolean(errors.stars)}
-              {...register("stars", {
-                required: "stars is required.",
-                valueAsNumber: true,
-                min: { value: 1, message: "stars must be between 1 and 5." },
-                max: { value: 5, message: "stars must be between 1 and 5." },
-              })}
+              {...register("stars", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests performs required validations and range/pattern checks
statusReason: Unable to find an element with the text: /stars is required/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:101:32
               isInvalid={Boolean(errors.stars)}
               {...register("stars", {
                 required: "stars is required.",
-                valueAsNumber: true,
+                valueAsNumber: false,
                 min: { value: 1, message: "stars must be between 1 and 5." },
                 max: { value: 5, message: "stars must be between 1 and 5." },
killedBy: MenuItemReviewForm tests submits numbers as numbers (itemId, stars)
statusReason: expected 'string' to be 'number' // Object.is equality

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:102:22
               {...register("stars", {
                 required: "stars is required.",
                 valueAsNumber: true,
-                min: { value: 1, message: "stars must be between 1 and 5." },
+                min: {},
                 max: { value: 5, message: "stars must be between 1 and 5." },
               })}
killedBy: MenuItemReviewForm tests shows min error for stars below 1
statusReason: Unable to find an element with the text: /stars must be between 1 and 5/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:103:22
                 required: "stars is required.",
                 valueAsNumber: true,
                 min: { value: 1, message: "stars must be between 1 and 5." },
-                max: { value: 5, message: "stars must be between 1 and 5." },
+                max: {},
               })}
             />
killedBy: MenuItemReviewForm tests performs required validations and range/pattern checks
statusReason: Unable to find an element with the text: /stars must be between 1 and 5/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:142:40
               data-testid={`${testIdPrefix}-comments`}
               id="comments"
               isInvalid={Boolean(errors.comments)}
-              {...register("comments", {
-                required: "comments is required.",
-                maxLength: { value: 500, message: "max 500 characters." },
-              })}
+              {...register("comments", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests performs required validations and range/pattern checks
statusReason: Unable to find an element with the text: /comments is required/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:144:28
               isInvalid={Boolean(errors.comments)}
               {...register("comments", {
                 required: "comments is required.",
-                maxLength: { value: 500, message: "max 500 characters." },
+                maxLength: {},
               })}
             />
killedBy: MenuItemReviewForm tests shows max length message for comments > 500
statusReason: Unable to find an element with the text: /max 500 characters\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
