[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:47:24
           isInvalid={Boolean(errors.orgCode)}
           {...register("orgCode", {
             required: "OrgCode is required.",
-            maxLength: {
-              value: 30,
-              message: "Max length 30 characters",
-            },
+            maxLength: {},
           })}
         />
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Max length 30 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:98:24
           aria-label="Inactive select"
           data-testid={testIdPrefix + "-inactive"}
           isInvalid={Boolean(errors.inactive)}
-          {...register("inactive", { required: "Inactive status is required" })}
+          {...register("", { required: "Inactive status is required" })}
         >
           <option value="">Select status...</option>
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading '_f')
