[Killed] ArrowFunction
main/pages/MenuItem/MenuItemCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function MenuItemCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (menuItem) => ({
-    url: "/api/ucsbdiningcommonsmenuitem/post",
-    method: "POST",
-    params: {
-      diningCommonsCode: menuItem.diningCommonsCode,
-      name: menuItem.name,
-      station: menuItem.station,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (menuItem) => {
killedBy: MenuItemCreatePage tests on submit, makes request to backend, and redirects to /ucsbdiningcommonsmenuitem
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/MenuItem/MenuItemCreatePage.jsx:18:35
     },
   });
 
-  const onSuccess = (menuItem) => {
-    toast(`New Menu Item Created - id: ${menuItem.id} name: ${menuItem.name}`);
-  };
+  const onSuccess = (menuItem) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemCreatePage tests on submit, makes request to backend, and redirects to /ucsbdiningcommonsmenuitem
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] StringLiteral
main/pages/MenuItem/MenuItemCreatePage.jsx:19:11
   });
 
   const onSuccess = (menuItem) => {
-    toast(`New Menu Item Created - id: ${menuItem.id} name: ${menuItem.name}`);
+    toast(``);
   };
 
killedBy: MenuItemCreatePage tests on submit, makes request to backend, and redirects to /ucsbdiningcommonsmenuitem
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "New Menu Item Created - id: 3 name: keereh-hasrat",
