[Killed] ArrowFunction
main/components/RecommendationRequest/RecommendationRequestTable.jsx:18:5
   };
 
   const deleteMutation = useBackendMutation(
-    (cell) => ({
-      url: "/api/recommendationrequests",
-      method: "DELETE",
-      params: { id: cell.row.values.id },
-    }),
+    () => undefined,
     { onSuccess: onDeleteSuccess },
     ["/api/recommendationrequests/all"],
killedBy: RecommendationRequestTable tests wires delete mutation with correct transform, options and deps
statusReason: expected undefined to deeply equal { …(3) }

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.jsx:19:12
 
   const deleteMutation = useBackendMutation(
     (cell) => ({
-      url: "/api/recommendationrequests",
+      url: "",
       method: "DELETE",
       params: { id: cell.row.values.id },
killedBy: RecommendationRequestTable tests wires delete mutation with correct transform, options and deps
statusReason: expected { url: '', method: 'DELETE', …(1) } to deeply equal { …(3) }

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.jsx:21:15
     (cell) => ({
       url: "/api/recommendationrequests",
       method: "DELETE",
-      params: { id: cell.row.values.id },
+      params: {},
     }),
     { onSuccess: onDeleteSuccess },
killedBy: RecommendationRequestTable tests wires delete mutation with correct transform, options and deps
statusReason: expected { …(3) } to deeply equal { …(3) }

[Killed] ArrayDeclaration
main/components/RecommendationRequest/RecommendationRequestTable.jsx:24:5
       params: { id: cell.row.values.id },
     }),
     { onSuccess: onDeleteSuccess },
-    ["/api/recommendationrequests/all"],
+    [],
   );
 
killedBy: RecommendationRequestTable tests wires delete mutation with correct transform, options and deps
statusReason: expected [] to deeply equal [ '/api/recommendationrequests/all' ]

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.jsx:52:5
       header: "Date Requested",
       accessorKey: "dateRequested",
     },
-    {
-      header: "Date Needed",
-      accessorKey: "dateNeeded",
-    },
+    {},
     {
       header: "Done",
killedBy: RecommendationRequestTable tests renders headers and rows correctly for ordinary user (no Edit/Delete)
statusReason: Columns require an id when using a non-string header

[Killed] ArrowFunction
main/components/RecommendationRequest/RecommendationRequestTable.jsx:59:13
     {
       header: "Done",
       accessorKey: "done",
-      cell: (cell) => String(cell.getValue()), // true/false 显示
+      cell: () => undefined, // true/false 显示
     },
   ];
killedBy: RecommendationRequestTable tests displays actual data correctly in table cells
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:
