[Killed] Regex
main/components/RecommendationRequest/RecommendationRequestForm.jsx:24:23
 
 
 //const isodate_regex = /\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d/;
-const isodate_regex = /\d-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d/;
+const isodate_regex = /\d-[01]\d-[0-3]\dT[0-2]\d:[0-5]\D/;
 
 
killedBy: RecommendationRequestForm tests accepts valid date at edge of valid range
statusReason: expected "spy" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] Regex
main/components/RecommendationRequest/RecommendationRequestForm.jsx:24:23
 
 
 //const isodate_regex = /\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d/;
-const isodate_regex = /\d-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d/;
+const isodate_regex = /\D-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d/;
 
 
killedBy: RecommendationRequestForm tests accepts valid date at edge of valid range
statusReason: expected "spy" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:36:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col md={6}>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="RecommendationRequestForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {false}
       </Row>
 
killedBy: RecommendationRequestForm tests renders correctly when passing in initialContents
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:36:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col md={6}>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="RecommendationRequestForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {true}
       </Row>
 
killedBy: RecommendationRequestForm tests renders correctly when passing in initialContents
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:103:49
               isInvalid={Boolean(errors.explanation)}
               {...register("explanation", {
                 required: "Please provide an explanation.",
-                minLength: { value: 3, message: "Too short." },
+                minLength: { value: 3, message: "" },
               })}
             />
killedBy: RecommendationRequestForm tests that the correct validations are performed (explanation min length)
statusReason: Unable to find an element with the text: Too short.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:128:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateRequested && "Date Requested is required (ISO)."}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests shows validation errors when submitting empty form
statusReason: Unable to find an element with the text: Date Requested is required (ISO).. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.jsx:128:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateRequested && "Date Requested is required (ISO)."}
+              {errors.dateRequested || "Date Requested is required (ISO)."}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests shows validation errors when submitting empty form
statusReason: Unable to find an element with the text: Requester email is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:147:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateNeeded && "Date Needed is required (ISO)."}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests shows validation errors when submitting empty form
statusReason: Unable to find an element with the text: Date Needed is required (ISO).. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.jsx:147:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateNeeded && "Date Needed is required (ISO)."}
+              {errors.dateNeeded || "Date Needed is required (ISO)."}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests shows validation errors when submitting empty form
statusReason: Unable to find an element with the text: Requester email is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
