[Killed] BlockStatement
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:61:43
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
-      
-    );
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
   return (
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"
